InformationRegisters/ТК_ТСД_ДанныеДляОтправкиТабак.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_ТСД_ДанныеДляОтправкиТабак</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД_События</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД_Передачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД_Сообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСканирования</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаСканирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтправкиФМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТК_Производитель</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТК_ТСД_ДанныеДляОтправкиТабак/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Функция ДанныеСканировки(МассивСтрок)
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	Для Каждого Стр Из МассивСтрок Цикл 
		Очередь = РегистрыСведений.ТК_ТСД_ДанныеДляОтправкиТабак.СоздатьМенеджерЗаписи();
		Очередь.ДокументСсылка = Стр.ДокументСсылка;
		Очередь.Производитель  = Стр.Производитель;
		Очередь.Статус  = Стр.Статус;
		Очередь.ДатаСканирования  = Стр.ДатаСканирования;
		
		Очередь.Прочитать();
		Если Очередь.Выбран() Тогда
			текСтрока = Очередь.ДанныеСканирования.Получить();
			Если текСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстовыйДокумент.ДобавитьСтроку(текСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат	ТекстовыйДокумент;
	
КонецФункции


&НаКлиенте
Процедура ПоказатьДанныеСканировки(Команда)
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = ДанныеСканировки(МассивСтрок);
	ТекстовыйДокумент.Показать();
КонецПроцедуры
